[
  {
    "id": "1",
    "image": "assets/images/doctors.svg",
    "source": "assets/images/doctors.svg",
    "header": "Insight Blood Pressure",
    "title": "What is blood pressure",
    "description": "According to the World Health Organization (WHO), blood pressure is defined as the force exerted by the blood on the walls of the arteries as it circulates throughout the body. Blood pressure is usually expressed in terms of two measurements: **systolic pressure** (the pressure in the arteries when the heart beats) and **diastolic pressure** (the pressure in the arteries when the heart is at rest between beats).\n\n **Blood Pressure Classification (WHO, 2018)**\n- **Optimal blood pressure:** Less than 120/80 mmHg.\n- **Normal blood pressure:** 120-129/80-84 mmHg\n- **Elevated blood pressure:** 130-139/85-89 mmHg.\n- **Grade 1 hypertension:** 140-159/90-99 mmHg.\n- **Grade 2 hypertension:** 160-179/100-109 mmHg\n- **Grade 3 hypertension:** 180 or higher/110 or higher mmHg.\n\n **Source:**\n- *World Health Organization. (2018). WHO Guidelines for the Management of Hypertension.*"
  },
  {
    "id": "2",
    "image": "assets/images/heart.svg",
    "source": "assets/images/heart.svg",
    "header": "Insight Blood Pressure",
    "title": "Details of blood pressure level",
    "description": "According to the World Health Organization (WHO), the following are the details of blood pressure levels:\n\n **Blood Pressure Classification (WHO, 2018)**\n- **Optimal blood pressure:**\n- *Systolic blood pressure (SBP): Less than 120 mmHg*\n- *Diastolic blood pressure (DBP): Less than 80mmHg*\n- **Normal blood pressure:**\n- *SBP 120-129 mmHg* \n- *DBP 80-84 mmHg*\n- **Elevated blood pressure:**\n- *SBP 130-139 mmHg* \n- *DBP 85-89 mmHg*\n- **Grade 1 hypertension:** \n- *SBP 140-159* \n- *DBP 90-99 mmHg*\n- **Grade 2 hypertension:** \n- *SBP 160-179* \n- *100-109 mmHg*\n- **Grade 3 hypertension:** \n- *180 or higher mmHg*\n- *110 or higher mmHg*\n\n **Additional definitions:** \n- **Isolated systolic hypertension:** SBP ≥ 140 mmHg and DBP < 90 mmHg. \n- **Isolated diastolic hypertension:** SBP < 140 mmHg and DBP ≥ 90 mmHg. \n- **White coat hypertension:** Elevated blood pressure in a clinical setting, but normal blood pressure at home.\n- **Masked hypertension:** Normal blood pressure in a clinical setting, but elevated blood pressure at home\n\n **WHO Guidelines for Blood Pressure Measurement**\n- Blood pressure should be measured in a seated position, with the arm at heart level.\n- The cuff should be of the correct size for the arm.\n- The measurement should be taken after a period of rest (at least 5 minutes).\n- Two or more readings should be taken, with the average value used for classification.\n\n **Interpretation of Blood Pressure Readings**\n- **Single reading:** A single blood pressure reading is not sufficient to diagnose hypertension. Multiple readings should be taken over time to confirm the diagnosis.\n- **Variability:** Blood pressure can vary throughout the day. A single reading may not accurately reflect an individual's usual blood pressure.\n- **Trend:** A trend of increasing blood pressure over time is more important than a single reading.\n\n**Note:** \n- It's important to note that these values are general guidelines, and individual cases may vary. It's always best to consult with a healthcare professional for a proper diagnosis and management of blood pressure levels.\n- These reference values are for adults aged 18 years and older.\n\n\n **Source:**\n- *World Health Organization. (2018). WHO Guidelines for the Management of Hypertension.*"
  },
  {
    "id": "3",
    "image": "assets/images/insight_board.svg",
    "source": "assets/images/insight_board.svg",
    "header": "Module Disclaimer",
    "title": "Disclaimer",
    "description": "Self-screening is intended for monitoring and tracking your health, not for diagnosing medical conditions.\n\n\nUsers can input their daily measurement readings into the app, which then generates charts and graphs to help monitor their health based on the data provided. Please note that the app does not measure the readings itself but only records and tracks the user-entered data.\n\nThe app currently draws information from reputable sources such as the CDC and WHO. However, please be aware that the data provided may not always reflect real-life situations accurately.\n\nThe app is intended for informational purposes only and is not a medical device. Users experiencing health issues should consult with doctors or healthcare professionals for appropriate advice and treatment."
  },
  {
    "id": "4",
    "image": "assets/images/Medical prescription-bro.svg",
    "source": "assets/images/Medical prescription-bro.svg",
    "header": "Insight Blood Pressure",
    "title": "How to prevent and manage low blood pressure",
    "description": "According to the World Health Organization (WHO), preventing and managing low blood pressure (hypotension) requires a combination of lifestyle changes, dietary modifications, and medical treatment. Here are the WHO-recommended guidelines for preventing and managing low blood pressure:\n\n **Prevention:**\n- **Maintain a healthy lifestyle:** Engage in regular physical activity, eat a balanced diet, and avoid smoking and excessive alcohol consumption.\n- **Stay hydrated:** Drink plenty of water and other fluids to help maintain blood volume and prevent dehydration.\n- **Manage stress:** Practice stress-reducing techniques like meditation, deep breathing, or yoga.\n- **Get enough sleep:** Aim for 7-8 hours of sleep per night to help regulate blood pressure.\n **Dietary Recommendations:**\n- **Increase salt intake:** Consume more salt to help increase blood volume and blood pressure. However, be mindful of excessive salt consumption, which can lead to other health problems.\n- **Eat small, frequent meals:** Eating smaller meals throughout the day can help prevent a drop in blood pressure after meals.\n- **Include blood-pressure-boosting foods:** Foods rich in vitamin B12, such as fish, eggs, and dairy products, can help increase blood pressure.\n- **Avoid caffeine and nicotine:** Both caffeine and nicotine can cause blood vessels to constrict, leading to a drop in blood pressure.\n\n **Management:**\n- **Monitor blood pressure:** Regularly monitor blood pressure to detect any changes or abnormalities.\n- **Medications:** If you have chronic low blood pressure, your doctor may prescribe medications to help increase blood pressure. These medications may include:\n- *Fludrocortisone (Florinef) to increase blood volume*/n- *Midodrine (ProAmatine) to constrict blood vessels and increase blood pressure*\n- *Ephedrine to increase blood pressure and heart rate*\n- **Compression stockings:** Wearing compression stockings can help improve circulation and increase blood pressure.\n- **Elevating the head of your bed:** Raising the head of your bed by 4-6 inches can help improve circulation and increase blood pressure.\n\n**Managing Low Blood Pressure Episodes:**\n- **Lie down:** If you experience a sudden drop in blood pressure, lie down and elevate your legs above the level of your heart.\n- **Drink water or other fluids:** Drink water or other fluids to help increase blood volume and blood pressure.\n- **Eat a snack:** Eating a snack rich in carbohydrates and protein can help increase blood sugar and blood pressure.\n- **Avoid standing up quickly:** When standing up, do so slowly and carefully to avoid a sudden drop in blood pressure.\n\n**WHO Guidelines for Low Blood Pressure:**\n- **Definition:** Low blood pressure is defined as a systolic blood pressure <90 mmHg or a diastolic blood pressure <60 mmHg.\n- **Classification:** Low blood pressure can be classified into three categories:\n- **Mild:** systolic blood pressure 90-100 mmHg or diastolic blood pressure 60-70 mmHg\n- **Moderate:** systolic blood pressure 80-89 mmHg or diastolic blood pressure 50-59 mmHg\n- **Severe:** systolic blood pressure <80 mmHg or diastolic blood pressure <50 mmHg\n- **Treatment goals:** The treatment goal for low blood pressure is to increase blood pressure to a level that is sufficient to maintain adequate organ perfusion and prevent symptoms.\n**Source:**\n- *World Health Organization. (2018). Hypotension*\n- *World Health Organization. (2019). Blood Pressure*\n- *World Health Organization. (2018). Guidelines for the Management of Hypotension*"
  },
  {
    "id": "5",
    "image": "assets/images/pills.svg",
    "source": "assets/images/pills.svg",
    "header": "Insight Blood Pressure",
    "title": "Knowledge of blood pressure drugs",
    "description": "According to the World Health Organization (WHO), the following are some common blood pressure drugs, their mechanisms of action, and potential side effects:\n\n**Diuretics:**\n- **Hydrochlorothiazide (HCTZ)**: Increases urine production, reducing blood volume and pressure.\n- *Side effects: Increased urination, potassium loss, dehydration.*\n- **Furosemide (Lasix)**: Increases urine production, reducing blood volume and pressure.\n- *Side effects: Increased urination, potassium loss, dehydration.*\n- **Spironolactone (Aldactone)**: Blocks aldosterone, reducing sodium reabsorption and increasing potassium levels.\n- *Side effects: Breast tenderness, gynecomastia, hyperkalemia.*\n\n**Beta Blockers:**\n- **Metoprolol (Lopressor)**: Reduces heart rate and contractility, decreasing cardiac output and blood pressure.\n- *Side effects: Fatigue, dizziness, bradycardia, bronchospasm.*\n- **Atenolol (Tenormin)**: Reduces heart rate and contractility, decreasing cardiac output and blood pressure.\n- *Side effects: Fatigue, dizziness, bradycardia, bronchospasm.*\n- **Propranolol (Inderal)**: Reduces heart rate and contractility, decreasing cardiac output and blood pressure.\n- *Side effects: Fatigue, dizziness, bradycardia, bronchospasm.*\n\n **Angiotensin-Converting Enzyme (ACE) Inhibitors:**\n- **Enalapril (Vasotec)**: Blocks angiotensin-converting enzyme, reducing angiotensin II levels and blood pressure.\n- *Side effects: Cough, hyperkalemia, renal impairment.*\n- **Lisinopril (Zestril)**: Blocks angiotensin-converting enzyme, reducing angiotensin II levels and blood pressure.\n- *Side effects: Cough, hyperkalemia, renal impairment.*\n- **Captopril (Capoten)**: Blocks angiotensin-converting enzyme, reducing angiotensin II levels and blood pressure.\n- *Side effects: Cough, hyperkalemia, renal impairment.*\n\n**Angiotensin Receptor Blockers (ARBs):**\n- **Losartan (Cozaar)**: Blocks angiotensin II receptors, reducing blood pressure.\n- *Side effects: Hyperkalemia, renal impairment, dizziness.*\n- **Valsartan (Diovan)**: Blocks angiotensin II receptors, reducing blood pressure.\n- *Side effects: Hyperkalemia, renal impairment, dizziness.*\n- **Candesartan (Atacand)**: Blocks angiotensin II receptors, reducing blood pressure.\n- *Side effects: Hyperkalemia, renal impairment, dizziness.*\n\n**Calcium Channel Blockers:**\n- **Amlodipine (Norvasc)**: Blocks calcium channels, reducing blood pressure.\n- *Side effects: Edema, dizziness, flushing.*\n- **Verapamil (Calan)**: Blocks calcium channels, reducing blood pressure.\n- *Side effects: Constipation, dizziness, bradycardia.*\n- **Diltiazem (Cardizem)**: Blocks calcium channels, reducing blood pressure.\n- *Side effects: Constipation, dizziness, bradycardia.*\n\n**Alpha Blockers:**\n- **Prazosin (Minipress)**: Blocks alpha receptors, reducing blood pressure.\n- *Side effects: Orthostatic hypotension, dizziness, nasal congestion.*\n- **Terazosin (Hytrin)**: Blocks alpha receptors, reducing blood pressure.\n- *Side effects: Orthostatic hypotension, dizziness, nasal congestion.*\n\n**Centrally Acting Agents:**\n- **Clonidine (Catapres)**: Stimulates alpha receptors in the brain, reducing blood pressure.\n- *Side effects: Drowsiness, dry mouth, constipation.*\n- **Methyldopa (Aldomet)**: Stimulates alpha receptors in the brain, reducing blood pressure.\n- *Side effects: Drowsiness, dry mouth, constipation.*\n\n**Vasodilators:**\n- **Hydralazine (Apresoline)**: Dilates blood vessels, reducing blood pressure.\n- *Side effects: Headache, tachycardia, lupus-like syndrome.*\n- **Minoxidil (Loniten)**: Dilates blood vessels, reducing blood pressure.\n- *Side effects: Hirsutism, tachycardia, pericardial effusion.*\n\n**WHO Guidelines for Blood Pressure Management:**\n- 1. **Lifestyle modifications**: Encourage lifestyle modifications, such as regular physical activity, a balanced diet, and stress reduction.\n- 2. **Pharmacological treatment**: Use pharmacological treatment to achieve a blood pressure target of <140/90 mmHg.\n- 3. **Combination therapy**: Use combination therapy to achieve blood pressure targets, especially in patients with multiple risk factors.\n- 4. **Monitoring**: Regularly monitor blood pressure and adjust treatment as needed.\n\n**Sources:**\n- *World Health Organization. (2018).*\n- World Health Organization. (2019). Blood Pressure.*\n- World Health Organization. (2018). Guidelines for the Management of Hypertension.*"
  }
,
  {
    "id": "6",
    "image": "assets/images/food.svg",
    "source": "assets/images/food.svg",
    "header": "Insight Blood Pressure",
    "title": "Foods to help manage high and low blood pressure",
    "description": "According to the World Health Organization (WHO), the following foods can help manage high and low blood pressure:\n\n**Foods to Help Manage High Blood Pressure:**\n- **Leafy Greens:** Spinach, kale, and collard greens are rich in potassium, calcium, and magnesium, which can help lower blood pressure.\n- **Berries:** Berries such as blueberries, strawberries, and raspberries are rich in flavonoids, which can help improve blood vessel function and lower blood pressure.\n- **Beets:** Beets are rich in nitrates, which can help relax blood vessels and lower blood pressure.\n- **Olive Oil:** Olive oil is rich in monounsaturated fats, which can help lower total cholesterol and LDL ('bad') cholesterol levels.\n- **Fatty Fish:** Fatty fish such as salmon, tuna, and mackerel are rich in omega-3 fatty acids, which can help lower triglycerides and blood pressure.\n- **Whole Grains:** Whole grains such as brown rice, quinoa, and whole wheat bread can help lower blood pressure by reducing sodium intake and increasing potassium intake.\n- **Legumes:** Legumes such as lentils, chickpeas, and black beans are rich in potassium, magnesium, and fiber, which can help lower blood pressure.\n- **Nuts and Seeds:** Nuts and seeds such as almonds, sunflower seeds, and pumpkin seeds are rich in magnesium and potassium, which can help lower blood pressure.\n- **Herbs and Spices:** Herbs and spices such as garlic, ginger, and turmeric have anti-inflammatory properties that can help lower blood pressure.\n- **Low-Fat Dairy:** Low-fat dairy products such as milk, cheese, and yogurt are rich in calcium, potassium, and magnesium, which can help lower blood pressure.\n\n**Foods to Help Manage Low Blood Pressure:**\n- **Salt-Rich Foods:** Foods high in salt such as soy sauce, fish sauce, and processed meats can help increase blood pressure.\n- **Caffeine:** Caffeine can help increase blood pressure by constricting blood vessels.\n- **Sugar-Rich Foods:** Foods high in sugar such as candy, baked goods, and sweetened beverages can help increase blood pressure.\n- **Refined Carbohydrates:** Refined carbohydrates such as white bread, sugary snacks, and sweetened beverages can help increase blood pressure.\n- **Foods High in Tyramine:** Foods high in tyramine such as aged cheese, wine, and fermented meats can help increase blood pressure.\n- **Ginseng:** Ginseng can help increase blood pressure by stimulating the nervous system.\n- **Licorice Root:** Licorice root can help increase blood pressure by increasing aldosterone levels.\n- **Cayenne Pepper:** Cayenne pepper can help increase blood pressure by constricting blood vessels.\n- **Ginger:** Ginger can help increase blood pressure by stimulating the nervous system.\n- **Foods High in Vitamin B12:** Foods high in vitamin B12 such as fish, eggs, and dairy products can help increase blood pressure.\n\n**WHO Guidelines for Blood Pressure Management:**\n- **Dietary Recommendations:** Encourage a balanced diet that is low in sodium, added sugars, and saturated fats, and high in fruits, vegetables, whole grains, and lean protein sources.\n- **Sodium Intake:** Limit sodium intake to less than 2,000 mg per day.\n- **Potassium Intake:** Increase potassium intake to at least 3,500 mg per day.\n- **Calcium Intake:** Increase calcium intake to at least 1,000 mg per day.\n- **Magnesium Intake:** Increase magnesium intake to at least 400 mg per day.\n\n**Sources:**\n- *World Health Organization. (2018).*\n- World Health Organization. (2019). Blood Pressure.*\n- World Health Organization. (2018). Guidelines for the Management of Hypertension.*"
  }
]