[
{
"id": "1",
"image": "assets/images/doctors.svg",
"source": "assets/images/doctors.svg",
"header": "Insight Blood Sugar",
"title": "What is blood sugar",
"description": "According to the World Health Organization (WHO), blood sugar is defined as the amount of glucose present in the blood. Blood sugar is usually expressed in terms of two measurements: **fasting blood sugar** (the level of glucose in the blood after an overnight fast) and **postprandial blood sugar** (the level of glucose in the blood after a meal).\n\n **Blood Sugar Classification (WHO, 2018)**\n- **Normal blood sugar:** Less than 100 mg/dL (fasting) and less than 140 mg/dL (postprandial).\n- **Impaired fasting glucose:** 100-125 mg/dL (fasting).\n- **Impaired glucose tolerance:** 140-199 mg/dL (postprandial).\n- **Diabetes:** 126 mg/dL or higher (fasting) and 200 mg/dL or higher (postprandial).\n\n **Source:**\n- *World Health Organization. (2018). WHO Guidelines for the Management of Diabetes.*"
},
{
"id": "2",
"image": "assets/images/heart.svg",
"source": "assets/images/heart.svg",
"header": "Insight Blood Sugar",
"title": "Details of blood sugar level",
"description": "According to the World Health Organization (WHO), the following are the details of blood sugar levels:\n\n **Blood Sugar Classification (WHO, 2018)**\n- **Normal blood sugar:**\n- *Fasting blood sugar: Less than 100 mg/dL*\n- *Postprandial blood sugar: Less than 140 mg/dL*\n- **Impaired fasting glucose:**\n- *Fasting blood sugar: 100-125 mg/dL*\n- **Impaired glucose tolerance:**\n- *Postprandial blood sugar: 140-199 mg/dL*\n- **Diabetes:**\n- *Fasting blood sugar: 126 mg/dL or higher*\n- *Postprandial blood sugar: 200 mg/dL or higher*\n\n **Additional definitions:** \n- **Glycemic control:** The ability to maintain blood sugar levels within a target range.\n- **Hypoglycemia:** Blood sugar levels below 70 mg/dL.\n- **Hyperglycemia:** Blood sugar levels above 180 mg/dL.\n\n **WHO Guidelines for Blood Sugar Measurement**\n- Blood sugar should be measured in a fasting state, at least 8 hours after the last meal.\n- The measurement should be taken using a glucometer or a laboratory test.\n- Two or more readings should be taken, with the average value used for classification.\n\n **Interpretation of Blood Sugar Readings**\n- **Single reading:** A single blood sugar reading is not sufficient to diagnose diabetes. Multiple readings should be taken over time to confirm the diagnosis.\n- **Variability:** Blood sugar can vary throughout the day. A single reading may not accurately reflect an individual's usual blood sugar.\n- **Trend:** A trend of increasing blood sugar over time is more important than a single reading.\n\n**Note:** \n- It's essential to note that these values are general guidelines, and individual cases may vary. It's always best to consult with a healthcare professional for a proper diagnosis and management of blood sugar levels.\n- These reference values are for adults aged 18 years and older.\n\n\n **Source:**\n- *World Health Organization. (2018). WHO Guidelines for the Management of Diabetes.*"
},
{
"id": "3",
"image": "assets/images/insight_board.svg",
"source": "assets/images/insight_board.svg",
"header": "Module Disclaimer",
"title": "Disclaimer",
"description": "Self-screening is intended for monitoring and tracking your health, not for diagnosing medical conditions.\n\n\nUsers can input their daily measurement readings into the app, which then generates charts and graphs to help monitor their health based on the data provided. Please note that the app does not measure the readings itself but only records and tracks the user-entered data.\n\nThe app currently draws information from reputable sources such as the CDC and WHO. However, please be aware that the data provided may not always reflect real-life situations accurately.\n\nThe app is intended for informational purposes only and is not a medical device. Users experiencing health issues should consult with doctors or healthcare professionals for appropriate advice and treatment."
},
{
"id": "4",
"image": "assets/images/Medical prescription-bro.svg",
"source": "assets/images/Medical prescription-bro.svg",
"header": "Insight Blood Sugar",
"title": "How to prevent and manage high and low blood sugar",
"description": "According to the World Health Organization (WHO), preventing and managing high and low blood sugar requires a combination of lifestyle changes, dietary modifications, and medical treatment. Here are the WHO-recommended guidelines for preventing and managing high and low blood sugar:\n\n **Prevention:**\n- **Maintain a healthy lifestyle:** Engage in regular physical activity, eat a balanced diet, and avoid smoking and excessive alcohol consumption.\n- **Monitor blood sugar:** Regularly monitor blood sugar to detect any changes or abnormalities.\n- **Get enough sleep:** Aim for 7-8 hours of sleep per night to help regulate blood sugar.\n **Dietary Recommendations:**\n- **Eat a balanced diet:** Focus on whole, unprocessed foods like vegetables, fruits, whole grains, lean proteins, and healthy fats.\n- **Choose low-carb foods:** Limit foods high in carbohydrates, added sugars, and saturated fats.\n- **Stay hydrated:** Drink plenty of water and other fluids to help regulate blood sugar.\n- **Limit caffeine and nicotine:** Both caffeine and nicotine can cause blood sugar to rise.\n\n **Management:**\n- **Medications:** If you have diabetes, your doctor may prescribe medications to help manage blood sugar. These medications may include:\n- *Metformin (Glucophage) to decrease glucose production in the liver*\n- *Sulfonylureas (Glyburide) to stimulate insulin release*\n- *Pioglitazone (Actos) to increase insulin sensitivity*\n- **Insulin therapy:** If you have type 1 diabetes or insulin-dependent type 2 diabetes, you may need insulin therapy to manage blood sugar.\n- **Monitoring:** Regularly monitor blood sugar to adjust treatment as needed.\n\n**Managing High Blood Sugar Episodes:**\n- **Drink water:** Drink water or other fluids to help lower blood sugar.\n- **Take medication:** Take medication as prescribed by your doctor to help lower blood sugar.\n- **Eat a snack:** Eat a snack rich in carbohydrates and protein to help lower blood sugar.\n- **Avoid strenuous activity:** Avoid strenuous activity until blood sugar returns to normal.\n\n**Managing Low Blood Sugar Episodes:**\n- **Eat a snack:** Eat a snack rich in carbohydrates and protein to help raise blood sugar.\n- **Drink juice or soda:** Drink juice or soda to help raise blood sugar.\n- **Take glucose tablets:** Take glucose tablets as prescribed by your doctor to help raise blood sugar.\n- **Seek medical attention:** Seek medical attention if symptoms persist or worsen.\n\n**WHO Guidelines for Blood Sugar Management:**\n- **Definition:** High blood sugar is defined as a fasting blood sugar ≥ 126 mg/dL or a postprandial blood sugar ≥ 200 mg/dL.\n- **Classification:** High blood sugar can be classified into three categories:\n- **Mild:** fasting blood sugar 126-140 mg/dL or postprandial blood sugar 200-240 mg/dL\n- **Moderate:** fasting blood sugar 141-160 mg/dL or postprandial blood sugar 241-280 mg/dL\n- **Severe:** fasting blood sugar ≥ 161 mg/dL or postprandial blood sugar ≥ 281 mg/dL\n- **Treatment goals:** The treatment goal for high blood sugar is to achieve a fasting blood sugar < 100 mg/dL and a postprandial blood sugar < 140 mg/dL.\n\n**Source:**\n- *World Health Organization. (2018). Diabetes*\n- *World Health Organization. (2019). Blood Sugar*\n- *World Health Organization. (2018). Guidelines for the Management of Diabetes*"
},
{
"id": "5",
"image": "assets/images/pills.svg",
"source": "assets/images/pills.svg",
"header": "Insight Blood Sugar",
"title": "Knowledge of blood sugar drugs",
"description": "According to the World Health Organization (WHO), the following are some common blood sugar drugs, their mechanisms of action, and potential side effects:\n\n**Metformin:**\n- **Mechanism of action:** Decreases glucose production in the liver and increases insulin sensitivity.\n- *Side effects: Gastrointestinal upset, diarrhea, abdominal pain.*\n\n**Sulfonylureas:**\n- **Mechanism of action:** Stimulates insulin release from the pancreas.\n- *Side effects: Hypoglycemia, weight gain, skin rash.*\n\n**Pioglitazone:**\n- **Mechanism of action:** Increases insulin sensitivity and decreases glucose production in the liver.\n- *Side effects: Edema, weight gain, increased risk of bladder cancer.*\n\n**Insulin:**\n- **Mechanism of action:** Lowers blood sugar by facilitating glucose uptake in cells.\n- *Side effects: Hypoglycemia, weight gain, injection site reactions.*\n\n**GLP-1 Receptor Agonists:**\n- **Mechanism of action:** Increases insulin release and decreases glucagon release.\n- *Side effects: Nausea, vomiting, diarrhea, increased risk of pancreatitis.*\n\n**SGLT-2 Inhibitors:**\n- **Mechanism of action:** Increases glucose excretion in the urine.\n- *Side effects: Genital mycotic infections, urinary tract infections, increased risk of kidney damage.*\n\n**WHO Guidelines for Blood Sugar Management:**\n- 1. **Lifestyle modifications**: Encourage lifestyle modifications, such as regular physical activity, a balanced diet, and stress reduction.\n- 2. **Pharmacological treatment**: Use pharmacological treatment to achieve a fasting blood sugar < 100 mg/dL and a postprandial blood sugar < 140 mg/dL.\n- 3. **Combination therapy**: Use combination therapy to achieve blood sugar targets, especially in patients with multiple risk factors.\n- 4. **Monitoring**: Regularly monitor blood sugar and adjust treatment as needed.\n\n**Sources:**\n- *World Health Organization. (2018).*\n- World Health Organization. (2019). Blood Sugar.*\n- World Health Organization. (2018). Guidelines for the Management of Diabetes.*"
},
{
"id": "6",
"image": "assets/images/food.svg",
"source": "assets/images/food.svg",
"header": "Insight Blood Sugar",
"title": "Foods to help manage high and low blood sugar",
"description": "According to the World Health Organization (WHO), the following foods can help manage high and low blood sugar:\n\n**Foods to Help Manage High Blood Sugar:**\n- **Leafy Greens:** Spinach, kale, and collard greens are rich in fiber, vitamins, and minerals that can help lower blood sugar.\n- **Berries:** Berries such as blueberries, strawberries, and raspberries are rich in antioxidants and fiber that can help lower blood sugar.\n- **Fatty Fish:** Fatty fish such as salmon, tuna, and mackerel are rich in omega-3 fatty acids that can help lower inflammation and improve insulin sensitivity.\n- **Whole Grains:** Whole grains such as brown rice, quinoa, and whole wheat bread can help lower blood sugar by reducing carbohydrate intake and increasing fiber intake.\n- **Legumes:** Legumes such as lentils, chickpeas, and black beans are rich in protein, fiber, and complex carbohydrates that can help lower blood sugar.\n- **Nuts and Seeds:** Nuts and seeds such as almonds, sunflower seeds, and pumpkin seeds are rich in healthy fats, protein, and fiber that can help lower blood sugar.\n- **Herbs and Spices:** Herbs and spices such as cinnamon, turmeric, and ginger have anti-inflammatory properties that can help lower blood sugar.\n- **Low-Fat Dairy:** Low-fat dairy products such as milk, cheese, and yogurt are rich in protein, calcium, and vitamins that can help lower blood sugar.\n\n**Foods to Help Manage Low Blood Sugar:**\n- **Fast-Acting Carbohydrates:** Foods high in fast-acting carbohydrates such as white bread, sugary snacks, and sweetened beverages can help raise blood sugar quickly.\n- **Fruits:** Fruits such as bananas, apples, and oranges are rich in natural sugars that can help raise blood sugar.\n- **Dried Fruits:** Dried fruits such as dates, apricots, and prunes are rich in natural sugars that can help raise blood sugar.\n- **Honey and Maple Syrup:** Honey and maple syrup are natural sweeteners that can help raise blood sugar.\n- **Candy and Chocolate:** Candy and chocolate are high in sugar and can help raise blood sugar quickly.\n\n**WHO Guidelines for Blood Sugar Management:**\n- **Dietary Recommendations:** Encourage a balanced diet that is low in added sugars, saturated fats, and refined carbohydrates, and high in whole, unprocessed foods.\n- **Carbohydrate Intake:** Limit carbohydrate intake to 45-65% of total daily calories.\n- **Fiber Intake:** Increase fiber intake to at least 25 grams per day.\n- **Protein Intake:** Increase protein intake to at least 0.8 grams per kilogram of body weight per day.\n\n**Sources:**\n- *World Health Organization. (2018).*\n- World Health Organization. (2019). Blood Sugar.*\n- World Health Organization. (2018). Guidelines for the Management of Diabetes.*"
}
]